onegbps/files/huawei/HX_FTH_IPTV_SER_POT_CRE.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="os.xsd.v1">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Username>clarity</wsse:Username>
      <wsse:Password >Test1234#</wsse:Password>
    </wsse:UsernameToken>
  </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <os:CREATE-SERVICEPORT>
         <os:MODIFIER>SERVICEPORT</os:MODIFIER>
         <os:object>
            <os:DEV>ADSL_ZTE_DNAME</os:DEV>
            <os:FN>FTTH_HUW_FN</os:FN>
            <os:SN>FTTH_HUW_SN</os:SN>
            <os:PN>FTTH_HUW_PN</os:PN>
         </os:object>
         <os:Session>1</os:Session>
         <os:objectParas>
            <os:VLANID>IPTV_SVLAN</os:VLANID>
            <os:ONTID>FTTH_HUW_VP</os:ONTID>
            <os:GEMPORTID>30</os:GEMPORTID>
            <os:TX>IPTV_HD_UP</os:TX>
            <os:RX>IPTV_HD</os:RX>
            <os:INNERVLANID>IPTV_VLAN</os:INNERVLANID>
            <os:UV>30</os:UV>
            <os:TAGTRANSFORM>3</os:TAGTRANSFORM>
         </os:objectParas>
      </os:CREATE-SERVICEPORT>
   </soapenv:Body>
</soapenv:Envelope>
